In [2]:
import pandas as pd
import numpy as np

# *  HIERARCHICAL INDEXING

In [3]:
# Multiple indexing
# Series with a list of lists as the index
data = pd.Series(np.random.rand(9), index = [['a','a','a', 'b', 'b', 'c','c','d','d'],
                                                [1,2,3,1,3,1,2,2,3]])
data

a  1    0.472503
   2    0.100092
   3    0.761768
b  1    0.890063
   3    0.983449
c  1    0.244222
   2    0.686754
d  2    0.535803
   3    0.108613
dtype: float64

In [4]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [5]:
print('All elements in b')
print(round(data['b'], 4))
print(' ')
print('MULTIREFERENCE')
print('Index specific')
print(round(data['b', 3], 4))
print('')
print('All elements between b and d inclusive')
print(round(data['b':'d'], 4))

All elements in b
1    0.8901
3    0.9834
dtype: float64

MULTIREFERENCE
Index specific
0.9834

All elements between b and d inclusive
b  1    0.8901
   3    0.9834
c  1    0.2442
   2    0.6868
d  2    0.5358
   3    0.1086
dtype: float64

In [6]:
# Converting Series into DataFrame
data2 = data.unstack()
data2

          1         2         3
a  0.472503  0.100092  0.761768
b  0.890063       NaN  0.983449
c  0.244222  0.686754       NaN
d       NaN  0.535803  0.108613

In [7]:
# Restacking DataFrame
data2.stack()

a  1    0.472503
   2    0.100092
   3    0.761768
b  1    0.890063
   3    0.983449
c  1    0.244222
   2    0.686754
d  2    0.535803
   3    0.108613
dtype: float64

## Sorting and Reordering

In [8]:
# Swapping the index
data.index.names = ['Alpha','Num']
data.swaplevel('Alpha','Num')

Num  Alpha
1    a        0.472503
2    a        0.100092
3    a        0.761768
1    b        0.890063
3    b        0.983449
1    c        0.244222
2    c        0.686754
     d        0.535803
3    d        0.108613
dtype: float64

In [9]:
# Interesting data display ((3 rows, 4 cols) as compared to (4 rows, 3 cols) refere above)
data.swaplevel('Alpha','Num').unstack()

Alpha         a         b         c         d
Num
1      0.472503  0.890063  0.244222       NaN
2      0.100092       NaN  0.686754  0.535803
3      0.761768  0.983449       NaN  0.108613

In [10]:
# Sorting by 2nd index descending
data.sort_index(ascending = False, level = 1)

Alpha  Num
d      3      0.108613
b      3      0.983449
a      3      0.761768
d      2      0.535803
c      2      0.686754
a      2      0.100092
c      1      0.244222
b      1      0.890063
a      1      0.472503
dtype: float64

In [11]:
# Sorting by 1st index descending
data.sort_index(ascending = False, level = 0)

Alpha  Num
d      3      0.108613
       2      0.535803
c      2      0.686754
       1      0.244222
b      3      0.983449
       1      0.890063
a      3      0.761768
       2      0.100092
       1      0.472503
dtype: float64

In [12]:
# Highest to lowest values (Possible use case for analysis e.g highest profit, best seller, etc)
data.sort_values(ascending = False)

Alpha  Num
b      3      0.983449
       1      0.890063
a      3      0.761768
c      2      0.686754
d      2      0.535803
a      1      0.472503
c      1      0.244222
d      3      0.108613
a      2      0.100092
dtype: float64

## Summary statistics

In [13]:
# Recap Series
data

Alpha  Num
a      1      0.472503
       2      0.100092
       3      0.761768
b      1      0.890063
       3      0.983449
c      1      0.244222
       2      0.686754
d      2      0.535803
       3      0.108613
dtype: float64

In [14]:
# Suming by the 1st index/alpha and suming by the 2nd index/num
print(data.groupby(level = 0).sum())
print('')
print(data.groupby(level = 1).sum())

Alpha
a    1.334363
b    1.873512
c    0.930976
d    0.644416
dtype: float64

Num
1    1.606788
2    1.322649
3    1.853830
dtype: float64

In [15]:
# Recap converted DataFrame
data2

          1         2         3
a  0.472503  0.100092  0.761768
b  0.890063       NaN  0.983449
c  0.244222  0.686754       NaN
d       NaN  0.535803  0.108613

In [16]:
# showing the sum of row b and the sum of column 3
print(data2.loc['b'].sum())
print(data2[3].sum())

1.8735120121122173
1.8538297403048576

In [17]:
# Comparing the number of elements in row a, row c and column 3
print(data2.loc['a'].count())
print('')
print(data2.loc['c'].count())
print('')
print(data2[3].count())

3

2

3

# * COMBINING AND MERGING DATASETS

In [18]:
df1 = pd.DataFrame({'key': ['b','b','a','c','a','a','c'], 'data1': range(7)})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'], 'data2': range(3)})

In [19]:
print(df2)
print('')
print(df1)

  key  data2
0   a      0
1   b      1
2   d      2

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   c      6

In [20]:
# Default to overlapping column as join criteria
pd.merge(df1, df2)
# It is good practice to specify join column e.g pd.merge(df1, df2, on = 'key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0

In [21]:
# same as df1 and 2 just with diffrerent key names for further practice
df3 = pd.DataFrame({'lkey': ['b','b','a','c','a','a','c'], 'data1': range(7)})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [22]:
# By default merge uses inner join, we have outer, left and right
pd.merge(df3, df4, left_on = 'lkey', right_on = 'rkey', how = 'left')
# Notice how d is not in the output

  lkey  data1 rkey  data2
0    b      0    b    1.0
1    b      1    b    1.0
2    a      2    a    0.0
3    c      3  NaN    NaN
4    a      4    a    0.0
5    a      5    a    0.0
6    c      6  NaN    NaN

In [23]:
# more syntax on join (specifying the left and right table) using inner join
pd.merge(left = df3,right = df4, left_on ='lkey', right_on = 'rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0

# * RESHAPING AND PIVOTING

## Revisiting stack and unstack

In [24]:
# Series created from Hierarchical indexing
data

Alpha  Num
a      1      0.472503
       2      0.100092
       3      0.761768
b      1      0.890063
       3      0.983449
c      1      0.244222
       2      0.686754
d      2      0.535803
       3      0.108613
dtype: float64

In [25]:
# unstack allows you to specify which index you want as columns
data.unstack('Alpha')
# equivalent to data.unstack(0)

Alpha         a         b         c         d
Num
1      0.472503  0.890063  0.244222       NaN
2      0.100092       NaN  0.686754  0.535803
3      0.761768  0.983449       NaN  0.108613

In [26]:
data.unstack('Num')
# equivalent to data.unstack(1)

Num           1         2         3
Alpha
a      0.472503  0.100092  0.761768
b      0.890063       NaN  0.983449
c      0.244222  0.686754       NaN
d           NaN  0.535803  0.108613

In [27]:
# Unstacked series presents NaN values, this wont be seen on the the Series unless you use falsify the dropna()
data.unstack().stack(dropna= False)
# Compare this output with 'data'

Alpha  Num
a      1      0.472503
       2      0.100092
       3      0.761768
b      1      0.890063
       2           NaN
       3      0.983449
c      1      0.244222
       2      0.686754
       3           NaN
d      1           NaN
       2      0.535803
       3      0.108613
dtype: float64

In [28]:
# Recap to converted DataFrame
data2

          1         2         3
a  0.472503  0.100092  0.761768
b  0.890063       NaN  0.983449
c  0.244222  0.686754       NaN
d       NaN  0.535803  0.108613

In [29]:
# Wide to long format
data2.melt()

    variable     value
0          1  0.472503
1          1  0.890063
2          1  0.244222
3          1       NaN
4          2  0.100092
5          2       NaN
6          2  0.686754
7          2  0.535803
8          3  0.761768
9          3  0.983449
10         3       NaN
11         3  0.108613